2024-07-23-db-notes:-modern-sql.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This is a personal note for the [[https://15445.courses.cs.cmu.edu/fall2022/notes/02-modernsql.pdf][CMU 15-445 L2 notes]]"
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>CMU 15-445 notes: Modern SQL</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="assets/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1>
          <a href="https://chenyo-17.github.io/org-static-blog"
            >Chenyo's org-static-blog</a
          >
        </h1>
        <nav>
          <a href="https://chenyo-17.github.io/org-static-blog">Home</a>
          <a href="archive.html">Archive</a>
          <a href="tags.html">Tags</a>
          <div id="search-container">
            <input
              type="text"
              id="search-input"
              placeholder="Search anywhere..."
            />
          </div>
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">23 Jul 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-07-23-db-notes:-modern-sql.html"
          >CMU 15-445 notes: Modern SQL</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#org071ad22">1. Terminology</a>
              <ul>
                <li>
                  <a href="#orgee84718">1.1. SQL and relational algebra</a>
                </li>
                <li><a href="#orgc88e3a6">1.2. SQL commands</a></li>
              </ul>
            </li>
            <li>
              <a href="#org815dae0">2. SQL syntax</a>
              <ul>
                <li><a href="#org9af268a">2.1. Join</a></li>
                <li><a href="#orge3093fd">2.2. Aggregation function</a></li>
                <li><a href="#org11ab1ab">2.3. String operation</a></li>
                <li><a href="#org4546a69">2.4. Date and time</a></li>
                <li><a href="#org31b8628">2.5. Output redirection</a></li>
                <li><a href="#orgf54395a">2.6. Output control</a></li>
                <li><a href="#org2066b18">2.7. Nested queries</a></li>
                <li><a href="#org23f04f1">2.8. Window functions</a></li>
                <li>
                  <a href="#org7c4a228">2.9. Common Table Expressions (CTE)</a>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </nav>
      <p>
        This is a personal note for the
        <a
          href="https://15445.courses.cs.cmu.edu/fall2022/notes/02-modernsql.pdf"
          >CMU 15-445 L2 notes</a
        >, along with some SQL command explained by
        <a href="https://claude.ai/chat/a2f07962-eb31-4f76-9a31-5e408722894b"
          >Claude.ai</a
        >.
      </p>
      <div id="outline-container-org071ad22" class="outline-2">
        <h2 id="org071ad22">
          <span class="section-number-2">1.</span> Terminology
        </h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-orgee84718" class="outline-3">
          <h3 id="orgee84718">
            <span class="section-number-3">1.1.</span> SQL and relational
            algebra
          </h3>
          <div class="outline-text-3" id="text-1-1">
            <ul class="org-ul">
              <li>
                Relational algebra is based on sets (unordered, no duplicates);
                SQL is based on bags (unordered, allows duplicates).
              </li>
              <li>
                SQL is a declarative query language; users use SQL to specify
                the desired result, each DBMS determines the most efficient
                strategy to produce the answer.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgc88e3a6" class="outline-3">
          <h3 id="orgc88e3a6">
            <span class="section-number-3">1.2.</span> SQL commands
          </h3>
          <div class="outline-text-3" id="text-1-2">
            <ul class="org-ul">
              <li>
                Data manipulation language (DML): <code>SELECT</code>,
                <code>INSERT</code>, <code>UPDATE</code>, <code>DELETE</code>.
              </li>
              <li>
                <p>Data definition language (DDL): <code>CREATE</code>.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #51afef;">CREATE</span> TABLR student (
    sid <span style="color: #ECBE7B;">INT</span> <span style="color: #51afef;">PRIMARY</span> <span style="color: #51afef;">KEY</span>,
    <span style="color: #51afef;">name</span> <span style="color: #ECBE7B;">VARCHAR</span>(<span style="color: #da8548; font-weight: bold;">16</span>),
    login <span style="color: #ECBE7B;">VARCHAR</span>(<span style="color: #da8548; font-weight: bold;">32</span>) <span style="color: #51afef;">UNIQUE</span>,
    age <span style="color: #ECBE7B;">SMALLINT</span>,
    gpa <span style="color: #ECBE7B;">FLOAT</span>
);
</pre>
                </div>
              </li>
              <li>Data control language (DCL): security, access control.</li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-org815dae0" class="outline-2">
        <h2 id="org815dae0">
          <span class="section-number-2">2.</span> SQL syntax
        </h2>
        <div class="outline-text-2" id="text-2"></div>
        <div id="outline-container-org9af268a" class="outline-3">
          <h3 id="org9af268a">
            <span class="section-number-3">2.1.</span> Join
          </h3>
          <div class="outline-text-3" id="text-2-1">
            <ul class="org-ul">
              <li>
                <p>
                  Combine columns from one or more tables and produces a new
                  table.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">All students that get an A in 15-721</span>
<span style="color: #51afef;">SELECT</span> s.<span style="color: #51afef;">name</span>
    <span style="color: #51afef;">FROM</span> enrolled <span style="color: #51afef;">AS</span> e, student <span style="color: #51afef;">AS</span> s
<span style="color: #51afef;">WHERE</span> e.grade = <span style="color: #98be65;">'A'</span> <span style="color: #51afef;">AND</span> e.cid = <span style="color: #98be65;">'15-721'</span>
    <span style="color: #51afef;">AND</span> e.sid = s.sid
</pre>
                </div>
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orge3093fd" class="outline-3">
          <h3 id="orge3093fd">
            <span class="section-number-3">2.2.</span> Aggregation function
          </h3>
          <div class="outline-text-3" id="text-2-2">
            <ul class="org-ul">
              <li>
                <code>AVG(COL)</code>, <code>MIN(COL)</code>,
                <code>MAX(COL)</code>, <code>COUNT(COL)</code>.
              </li>
              <li>
                <p>
                  Take as input a bag of tuples and produce a single scalar
                  value.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get number of students and their average GPA with a '@cs' login</span>
<span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">AVG</span>(gpa), <span style="color: #c678dd;">COUNT</span>(sid) <span style="color: #51afef;">FROM</span> student <span style="color: #51afef;">WHERE</span> login <span style="color: #51afef;">LIKE</span> <span style="color: #98be65;">'@cs'</span>;
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get the unique students</span>
<span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">COUNT</span>(<span style="color: #51afef;">DISTINCT</span> login) <span style="color: #51afef;">FROM</span> student <span style="color: #51afef;">WHERE</span> login <span style="color: #51afef;">LIKE</span> <span style="color: #98be65;">'@cs'</span>;
</pre>
                </div>
              </li>
              <li>
                <p>
                  Non-aggregated values in <code>SELECT</code> output must
                  appear in <code>GROUP BY</code>.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get the average GPA in each course</span>
<span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">AVG</span>(s.gpa), e.cid
    <span style="color: #51afef;">FROM</span> enrolled <span style="color: #51afef;">AS</span> e, student <span style="color: #51afef;">AS</span> s
<span style="color: #51afef;">WHERE</span> e.sid = s.sid
<span style="color: #51afef;">GROUP</span> <span style="color: #51afef;">BY</span> e.cid;
</pre>
                </div>
              </li>
              <li>
                <p>
                  <code>HAVING</code>: filter output results based on
                  aggregation computation.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">AVG</span>(s.gpa), e.cid
    <span style="color: #51afef;">FROM</span> enrolled <span style="color: #51afef;">AS</span> e, student <span style="color: #51afef;">AS</span> s
<span style="color: #51afef;">WHERE</span> e.sid = s.sid
<span style="color: #51afef;">GROUP</span> <span style="color: #51afef;">BY</span> e.cid
<span style="color: #51afef;">HAVING</span> <span style="color: #c678dd;">AVG</span>(s.gpa) &gt; <span style="color: #da8548; font-weight: bold;">3.9</span>;
</pre>
                </div>
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org11ab1ab" class="outline-3">
          <h3 id="org11ab1ab">
            <span class="section-number-3">2.3.</span> String operation
          </h3>
          <div class="outline-text-3" id="text-2-3">
            <ul class="org-ul">
              <li>
                Strings are case sensitive and single-quotes only in the SQL
                standard.
              </li>
              <li>
                Use <code>LIKE</code> for string pattern matching:
                <ul class="org-ul">
                  <li><code>%</code> matches any sub-string,</li>
                  <li><code>_</code> matches any one character</li>
                </ul>
              </li>
              <li>
                Standard string functions: <code>UPPER(S)</code>,
                <code>SUBSTRING(S, B, E)</code>.
              </li>
              <li><code>||</code>: string concatenation.</li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org4546a69" class="outline-3">
          <h3 id="org4546a69">
            <span class="section-number-3">2.4.</span> Date and time
          </h3>
          <div class="outline-text-3" id="text-2-4">
            <ul class="org-ul">
              <li>Attributes: <code>DATE</code>, <code>TIME</code>.</li>
              <li>Different DBMS have different date/time operations.</li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org31b8628" class="outline-3">
          <h3 id="org31b8628">
            <span class="section-number-3">2.5.</span> Output redirection
          </h3>
          <div class="outline-text-3" id="text-2-5">
            <ul class="org-ul">
              <li>
                <p>One can store the results into another table</p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">output to a non-existing table</span>
<span style="color: #51afef;">SELECT</span> <span style="color: #51afef;">DISTINCT</span> cis <span style="color: #51afef;">INTO</span> CourseIds <span style="color: #51afef;">FROM</span> enrolled;
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">output to an existing table with the same number of columns and column type</span>
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">but the names do not matter</span>
<span style="color: #51afef;">INSERT</span> <span style="color: #51afef;">INTO</span> CourseIds (<span style="color: #51afef;">SELECT</span> <span style="color: #51afef;">DISTINCT</span> cid <span style="color: #51afef;">FROM</span> enrolled);
</pre>
                </div>
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgf54395a" class="outline-3">
          <h3 id="orgf54395a">
            <span class="section-number-3">2.6.</span> Output control
          </h3>
          <div class="outline-text-3" id="text-2-6">
            <ul class="org-ul">
              <li>
                Use <code>ORDER</code>, <code>ASC</code> and
                <code>DESC</code> to sort the output tuples; otherwise the
                output could have different order every time.
              </li>
              <li>
                <p>
                  Use <code>LIMIT</code>, <code>OFFSET</code> to restrict the
                  output number.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #51afef;">SELECT</span> sid <span style="color: #51afef;">FROM</span> enrolled <span style="color: #51afef;">WHERE</span> cid = <span style="color: #98be65;">'15-721'</span>
<span style="color: #51afef;">ORDER</span> <span style="color: #51afef;">BY</span> <span style="color: #c678dd;">UPPER</span>(grade) <span style="color: #51afef;">DESC</span>, sid + <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #51afef;">ASC</span>;
    <span style="color: #51afef;">LIMIT</span> <span style="color: #da8548; font-weight: bold;">10</span> OFFSET <span style="color: #da8548; font-weight: bold;">10</span>;  <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">output 10 tuples, starting from the 11th tuple</span>
</pre>
                </div>
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org2066b18" class="outline-3">
          <h3 id="org2066b18">
            <span class="section-number-3">2.7.</span> Nested queries
          </h3>
          <div class="outline-text-3" id="text-2-7">
            <ul class="org-ul">
              <li>Nested queries are often difficult to optimize.</li>
              <li>
                The inner query can access attributes defined in the outer
                query.
              </li>
              <li>
                <p>Inner queries can appear anywhere.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Output a column 'one' with 1s, the number of 1s</span>
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">equals to the number of rows in 'student'</span>
<span style="color: #51afef;">SELECT</span> (<span style="color: #51afef;">SELECT</span> <span style="color: #da8548; font-weight: bold;">1</span>) <span style="color: #51afef;">AS</span> one <span style="color: #51afef;">FROM</span> student;

<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get the names of students that are enrolled in '15-445'</span>
<span style="color: #51afef;">SELECT</span> <span style="color: #51afef;">name</span> <span style="color: #51afef;">FROM</span> students
    <span style="color: #51afef;">WHERE</span> sid <span style="color: #51afef;">IN</span> (
        <span style="color: #51afef;">SELECT</span> sid <span style="color: #51afef;">FROM</span> enrolled
        <span style="color: #51afef;">WHERE</span> cid = <span style="color: #98be65;">'15-445'</span>
);

<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get student record with the highest id</span>
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">that is enrolled in at least one course.</span>
<span style="color: #51afef;">SELECT</span> student.sid, <span style="color: #51afef;">name</span>
    <span style="color: #51afef;">FROM</span> student
    <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">the intermediate output is aliases as max_e</span>
    <span style="color: #51afef;">JOIN</span> (<span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">MAX</span>(sid) <span style="color: #51afef;">AS</span> sid <span style="color: #51afef;">FROM</span> enrolled) <span style="color: #51afef;">AS</span> max_e
    <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">only select student who has the max_e</span>
    <span style="color: #51afef;">ON</span> student.sid = max_e.sid;

<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">the above is same as below, but `join` syntax is more preferred</span>
<span style="color: #51afef;">SELECT</span> student.sid, <span style="color: #51afef;">name</span>
<span style="color: #51afef;">FROM</span> student <span style="color: #51afef;">AS</span> s, (<span style="color: #51afef;">SELECT</span> <span style="color: #c678dd;">MAX</span>(sid) <span style="color: #51afef;">AS</span> sid <span style="color: #51afef;">FROM</span> enrolled) <span style="color: #51afef;">AS</span> max_e
<span style="color: #51afef;">WHERE</span> s.sid = max_e.sid;
</pre>
                </div>
              </li>

              <li>
                Nested query results expression:
                <ul class="org-ul">
                  <li>
                    <code>ALL</code>: must satisfy expression for all
                    <b><b>rows</b></b> in sub-query.
                  </li>
                  <li>
                    <code>ANY</code>, <code>IN</code>: must satisfy expression
                    for at least one row in sub-query.
                  </li>
                  <li>
                    <p><code>EXISTS</code>: at least one row is returned.</p>
                    <div class="org-src-container">
                      <pre
                        class="src src-sql"
                      ><span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get all courses with no students enrolled in</span>
<span style="color: #51afef;">SELECT</span> * <span style="color: #51afef;">FROM</span> course
    <span style="color: #51afef;">WHERE</span> <span style="color: #51afef;">NOT</span> <span style="color: #51afef;">EXISTS</span>(
        <span style="color: #51afef;">SELECT</span> * <span style="color: #51afef;">FROM</span> enrolled
            <span style="color: #51afef;">WHERE</span> course.cid = enrolled.cid
)

<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">Get students whose gpa is larget than the highest score in '15-712'</span>
<span style="color: #5B6268;">-- </span><span style="color: #5B6268;">and the login has a level &gt; 3</span>
<span style="color: #51afef;">SELECT</span> student.sid, <span style="color: #51afef;">name</span>
    <span style="color: #51afef;">FROM</span> student <span style="color: #51afef;">AS</span> S
<span style="color: #51afef;">WHERE</span> s.gpa &gt; <span style="color: #51afef;">ALL</span> (
    <span style="color: #51afef;">SELECT</span> course.score <span style="color: #51afef;">FROM</span> course
        <span style="color: #51afef;">WHERE</span> course.cid = <span style="color: #98be65;">'15-712'</span>
)
<span style="color: #51afef;">AND</span> student.login <span style="color: #51afef;">IN</span> (
    <span style="color: #51afef;">SELECT</span> login <span style="color: #51afef;">FROM</span> enrolled
    <span style="color: #51afef;">WHERE</span> <span style="color: #51afef;">level</span> &gt; <span style="color: #da8548; font-weight: bold;">3</span>
);
</pre>
                    </div>
                  </li>
                </ul>
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org23f04f1" class="outline-3">
          <h3 id="org23f04f1">
            <span class="section-number-3">2.8.</span> Window functions
          </h3>
          <div class="outline-text-3" id="text-2-8">
            <ul class="org-ul">
              <li>Perform sliding calculation across a set of tuples.</li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org7c4a228" class="outline-3">
          <h3 id="org7c4a228">
            <span class="section-number-3">2.9.</span> Common Table Expressions
            (CTE)
          </h3>
          <div class="outline-text-3" id="text-2-9">
            <ul class="org-ul">
              <li>
                An alternative to windows or nested queries when writing more
                complex queries.
              </li>
              <li>
                <p>
                  CTEs use <code>WITH</code> to bind the output of an inner
                  query to a temporary table.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-sql"
                  ><span style="color: #51afef;">WITH</span> cteName (col1, col2) <span style="color: #51afef;">AS</span> (
    <span style="color: #51afef;">SELECT</span> <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>
)
<span style="color: #51afef;">SELECT</span> col1 + col2 <span style="color: #51afef;">FROM</span> cteName;
</pre>
                </div>
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-study.html"
          >study</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-database.html"
          >database</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-cmu.html"
          >cmu</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="search-results"></div>
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
